jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/sdmmc.h
/* -------- SDMMC_TMR : (SDMMC Offset: 0x0C) (R/W 16) Transfer Mode -------- */
#define SDMMC_TMR_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDMMC_TMR) Transfer Mode  Reset Value */

#define SDMMC_TMR_DMAEN_Pos                   _UINT16_(0)                                          /* (SDMMC_TMR) DMA Enable Position */
#define SDMMC_TMR_DMAEN_Msk                   (_UINT16_(0x1) << SDMMC_TMR_DMAEN_Pos)               /* (SDMMC_TMR) DMA Enable Mask */
#define SDMMC_TMR_DMAEN(value)                (SDMMC_TMR_DMAEN_Msk & (_UINT16_(value) << SDMMC_TMR_DMAEN_Pos)) /* Assigment of value for DMAEN in the SDMMC_TMR register */
#define   SDMMC_TMR_DMAEN_DISABLE_Val         _UINT16_(0x0)                                        /* (SDMMC_TMR) No data transfer or Non DMA data transfer  */
#define   SDMMC_TMR_DMAEN_ENABLE_Val          _UINT16_(0x1)                                        /* (SDMMC_TMR) DMA data transfer  */
#define SDMMC_TMR_DMAEN_DISABLE               (SDMMC_TMR_DMAEN_DISABLE_Val << SDMMC_TMR_DMAEN_Pos) /* (SDMMC_TMR) No data transfer or Non DMA data transfer Position  */
#define SDMMC_TMR_DMAEN_ENABLE                (SDMMC_TMR_DMAEN_ENABLE_Val << SDMMC_TMR_DMAEN_Pos)  /* (SDMMC_TMR) DMA data transfer Position  */
#define SDMMC_TMR_BCEN_Pos                    _UINT16_(1)                                          /* (SDMMC_TMR) Block Count Enable Position */
#define SDMMC_TMR_BCEN_Msk                    (_UINT16_(0x1) << SDMMC_TMR_BCEN_Pos)                /* (SDMMC_TMR) Block Count Enable Mask */
#define SDMMC_TMR_BCEN(value)                 (SDMMC_TMR_BCEN_Msk & (_UINT16_(value) << SDMMC_TMR_BCEN_Pos)) /* Assigment of value for BCEN in the SDMMC_TMR register */
#define   SDMMC_TMR_BCEN_DISABLE_Val          _UINT16_(0x0)                                        /* (SDMMC_TMR) Disable  */
#define   SDMMC_TMR_BCEN_ENABLE_Val           _UINT16_(0x1)                                        /* (SDMMC_TMR) Enable  */
#define SDMMC_TMR_BCEN_DISABLE                (SDMMC_TMR_BCEN_DISABLE_Val << SDMMC_TMR_BCEN_Pos)   /* (SDMMC_TMR) Disable Position  */
#define SDMMC_TMR_BCEN_ENABLE                 (SDMMC_TMR_BCEN_ENABLE_Val << SDMMC_TMR_BCEN_Pos)    /* (SDMMC_TMR) Enable Position  */
#define SDMMC_TMR_ACMDEN_Pos                  _UINT16_(2)                                          /* (SDMMC_TMR) Auto Command Enable Position */
#define SDMMC_TMR_ACMDEN_Msk                  (_UINT16_(0x3) << SDMMC_TMR_ACMDEN_Pos)              /* (SDMMC_TMR) Auto Command Enable Mask */
#define SDMMC_TMR_ACMDEN(value)               (SDMMC_TMR_ACMDEN_Msk & (_UINT16_(value) << SDMMC_TMR_ACMDEN_Pos)) /* Assigment of value for ACMDEN in the SDMMC_TMR register */
#define   SDMMC_TMR_ACMDEN_DISABLED_Val       _UINT16_(0x0)                                        /* (SDMMC_TMR) Auto Command Disabled  */
#define   SDMMC_TMR_ACMDEN_CMD12_Val          _UINT16_(0x1)                                        /* (SDMMC_TMR) Auto CMD12 Enable  */
#define   SDMMC_TMR_ACMDEN_CMD23_Val          _UINT16_(0x2)                                        /* (SDMMC_TMR) Auto CMD23 Enable  */
#define SDMMC_TMR_ACMDEN_DISABLED             (SDMMC_TMR_ACMDEN_DISABLED_Val << SDMMC_TMR_ACMDEN_Pos) /* (SDMMC_TMR) Auto Command Disabled Position  */
#define SDMMC_TMR_ACMDEN_CMD12                (SDMMC_TMR_ACMDEN_CMD12_Val << SDMMC_TMR_ACMDEN_Pos) /* (SDMMC_TMR) Auto CMD12 Enable Position  */
#define SDMMC_TMR_ACMDEN_CMD23                (SDMMC_TMR_ACMDEN_CMD23_Val << SDMMC_TMR_ACMDEN_Pos) /* (SDMMC_TMR) Auto CMD23 Enable Position  */
#define SDMMC_TMR_DTDSEL_Pos                  _UINT16_(4)                                          /* (SDMMC_TMR) Data Transfer Direction Selection Position */
#define SDMMC_TMR_DTDSEL_Msk                  (_UINT16_(0x1) << SDMMC_TMR_DTDSEL_Pos)              /* (SDMMC_TMR) Data Transfer Direction Selection Mask */
#define SDMMC_TMR_DTDSEL(value)               (SDMMC_TMR_DTDSEL_Msk & (_UINT16_(value) << SDMMC_TMR_DTDSEL_Pos)) /* Assigment of value for DTDSEL in the SDMMC_TMR register */
#define   SDMMC_TMR_DTDSEL_WRITE_Val          _UINT16_(0x0)                                        /* (SDMMC_TMR) Write (Host to Card)  */
#define   SDMMC_TMR_DTDSEL_READ_Val           _UINT16_(0x1)                                        /* (SDMMC_TMR) Read (Card to Host)  */
#define SDMMC_TMR_DTDSEL_WRITE                (SDMMC_TMR_DTDSEL_WRITE_Val << SDMMC_TMR_DTDSEL_Pos) /* (SDMMC_TMR) Write (Host to Card) Position  */
#define SDMMC_TMR_DTDSEL_READ                 (SDMMC_TMR_DTDSEL_READ_Val << SDMMC_TMR_DTDSEL_Pos)  /* (SDMMC_TMR) Read (Card to Host) Position  */
#define SDMMC_TMR_MSBSEL_Pos                  _UINT16_(5)                                          /* (SDMMC_TMR) Multi/Single Block Selection Position */
#define SDMMC_TMR_MSBSEL_Msk                  (_UINT16_(0x1) << SDMMC_TMR_MSBSEL_Pos)              /* (SDMMC_TMR) Multi/Single Block Selection Mask */
#define SDMMC_TMR_MSBSEL(value)               (SDMMC_TMR_MSBSEL_Msk & (_UINT16_(value) << SDMMC_TMR_MSBSEL_Pos)) /* Assigment of value for MSBSEL in the SDMMC_TMR register */
#define   SDMMC_TMR_MSBSEL_SINGLE_Val         _UINT16_(0x0)                                        /* (SDMMC_TMR) Single Block  */
#define   SDMMC_TMR_MSBSEL_MULTIPLE_Val       _UINT16_(0x1)                                        /* (SDMMC_TMR) Multiple Block  */
#define SDMMC_TMR_MSBSEL_SINGLE               (SDMMC_TMR_MSBSEL_SINGLE_Val << SDMMC_TMR_MSBSEL_Pos) /* (SDMMC_TMR) Single Block Position  */
#define SDMMC_TMR_MSBSEL_MULTIPLE             (SDMMC_TMR_MSBSEL_MULTIPLE_Val << SDMMC_TMR_MSBSEL_Pos) /* (SDMMC_TMR) Multiple Block Position  */
#define SDMMC_TMR_Msk                         _UINT16_(0x003F)                                     /* (SDMMC_TMR) Register Mask  */


/* -------- SDMMC_CR : (SDMMC Offset: 0x0E) (R/W 16) Command -------- */
#define SDMMC_CR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDMMC_CR) Command  Reset Value */

#define SDMMC_CR_RESPTYP_Pos                  _UINT16_(0)                                          /* (SDMMC_CR) Response Type Position */
#define SDMMC_CR_RESPTYP_Msk                  (_UINT16_(0x3) << SDMMC_CR_RESPTYP_Pos)              /* (SDMMC_CR) Response Type Mask */
#define SDMMC_CR_RESPTYP(value)               (SDMMC_CR_RESPTYP_Msk & (_UINT16_(value) << SDMMC_CR_RESPTYP_Pos)) /* Assigment of value for RESPTYP in the SDMMC_CR register */
#define   SDMMC_CR_RESPTYP_NONE_Val           _UINT16_(0x0)                                        /* (SDMMC_CR) No response  */
#define   SDMMC_CR_RESPTYP_136_BIT_Val        _UINT16_(0x1)                                        /* (SDMMC_CR) 136-bit response  */
#define   SDMMC_CR_RESPTYP_48_BIT_Val         _UINT16_(0x2)                                        /* (SDMMC_CR) 48-bit response  */
#define   SDMMC_CR_RESPTYP_48_BIT_BUSY_Val    _UINT16_(0x3)                                        /* (SDMMC_CR) 48-bit response check busy after response  */
#define SDMMC_CR_RESPTYP_NONE                 (SDMMC_CR_RESPTYP_NONE_Val << SDMMC_CR_RESPTYP_Pos)  /* (SDMMC_CR) No response Position  */
#define SDMMC_CR_RESPTYP_136_BIT              (SDMMC_CR_RESPTYP_136_BIT_Val << SDMMC_CR_RESPTYP_Pos) /* (SDMMC_CR) 136-bit response Position  */
#define SDMMC_CR_RESPTYP_48_BIT               (SDMMC_CR_RESPTYP_48_BIT_Val << SDMMC_CR_RESPTYP_Pos) /* (SDMMC_CR) 48-bit response Position  */
#define SDMMC_CR_RESPTYP_48_BIT_BUSY          (SDMMC_CR_RESPTYP_48_BIT_BUSY_Val << SDMMC_CR_RESPTYP_Pos) /* (SDMMC_CR) 48-bit response check busy after response Position  */
#define SDMMC_CR_CMDCCEN_Pos                  _UINT16_(3)                                          /* (SDMMC_CR) Command CRC Check Enable Position */
#define SDMMC_CR_CMDCCEN_Msk                  (_UINT16_(0x1) << SDMMC_CR_CMDCCEN_Pos)              /* (SDMMC_CR) Command CRC Check Enable Mask */
#define SDMMC_CR_CMDCCEN(value)               (SDMMC_CR_CMDCCEN_Msk & (_UINT16_(value) << SDMMC_CR_CMDCCEN_Pos)) /* Assigment of value for CMDCCEN in the SDMMC_CR register */
#define   SDMMC_CR_CMDCCEN_DISABLE_Val        _UINT16_(0x0)                                        /* (SDMMC_CR) Disable  */
#define   SDMMC_CR_CMDCCEN_ENABLE_Val         _UINT16_(0x1)                                        /* (SDMMC_CR) Enable  */
#define SDMMC_CR_CMDCCEN_DISABLE              (SDMMC_CR_CMDCCEN_DISABLE_Val << SDMMC_CR_CMDCCEN_Pos) /* (SDMMC_CR) Disable Position  */
#define SDMMC_CR_CMDCCEN_ENABLE               (SDMMC_CR_CMDCCEN_ENABLE_Val << SDMMC_CR_CMDCCEN_Pos) /* (SDMMC_CR) Enable Position  */
#define SDMMC_CR_CMDICEN_Pos                  _UINT16_(4)                                          /* (SDMMC_CR) Command Index Check Enable Position */
#define SDMMC_CR_CMDICEN_Msk                  (_UINT16_(0x1) << SDMMC_CR_CMDICEN_Pos)              /* (SDMMC_CR) Command Index Check Enable Mask */
#define SDMMC_CR_CMDICEN(value)               (SDMMC_CR_CMDICEN_Msk & (_UINT16_(value) << SDMMC_CR_CMDICEN_Pos)) /* Assigment of value for CMDICEN in the SDMMC_CR register */
#define   SDMMC_CR_CMDICEN_DISABLE_Val        _UINT16_(0x0)                                        /* (SDMMC_CR) Disable  */
#define   SDMMC_CR_CMDICEN_ENABLE_Val         _UINT16_(0x1)                                        /* (SDMMC_CR) Enable  */
#define SDMMC_CR_CMDICEN_DISABLE              (SDMMC_CR_CMDICEN_DISABLE_Val << SDMMC_CR_CMDICEN_Pos) /* (SDMMC_CR) Disable Position  */
#define SDMMC_CR_CMDICEN_ENABLE               (SDMMC_CR_CMDICEN_ENABLE_Val << SDMMC_CR_CMDICEN_Pos) /* (SDMMC_CR) Enable Position  */
#define SDMMC_CR_DPSEL_Pos                    _UINT16_(5)                                          /* (SDMMC_CR) Data Present Select Position */
#define SDMMC_CR_DPSEL_Msk                    (_UINT16_(0x1) << SDMMC_CR_DPSEL_Pos)                /* (SDMMC_CR) Data Present Select Mask */
#define SDMMC_CR_DPSEL(value)                 (SDMMC_CR_DPSEL_Msk & (_UINT16_(value) << SDMMC_CR_DPSEL_Pos)) /* Assigment of value for DPSEL in the SDMMC_CR register */
#define   SDMMC_CR_DPSEL_NO_DATA_Val          _UINT16_(0x0)                                        /* (SDMMC_CR) No Data Present  */
#define   SDMMC_CR_DPSEL_DATA_Val             _UINT16_(0x1)                                        /* (SDMMC_CR) Data Present  */
#define SDMMC_CR_DPSEL_NO_DATA                (SDMMC_CR_DPSEL_NO_DATA_Val << SDMMC_CR_DPSEL_Pos)   /* (SDMMC_CR) No Data Present Position  */
#define SDMMC_CR_DPSEL_DATA                   (SDMMC_CR_DPSEL_DATA_Val << SDMMC_CR_DPSEL_Pos)      /* (SDMMC_CR) Data Present Position  */
#define SDMMC_CR_CMDTYP_Pos                   _UINT16_(6)                                          /* (SDMMC_CR) Command Type Position */
#define SDMMC_CR_CMDTYP_Msk                   (_UINT16_(0x3) << SDMMC_CR_CMDTYP_Pos)               /* (SDMMC_CR) Command Type Mask */
#define SDMMC_CR_CMDTYP(value)                (SDMMC_CR_CMDTYP_Msk & (_UINT16_(value) << SDMMC_CR_CMDTYP_Pos)) /* Assigment of value for CMDTYP in the SDMMC_CR register */
#define   SDMMC_CR_CMDTYP_NORMAL_Val          _UINT16_(0x0)                                        /* (SDMMC_CR) Other commands  */
#define   SDMMC_CR_CMDTYP_SUSPEND_Val         _UINT16_(0x1)                                        /* (SDMMC_CR) CMD52 for writing Bus Suspend in CCCR  */
#define   SDMMC_CR_CMDTYP_RESUME_Val          _UINT16_(0x2)                                        /* (SDMMC_CR) CMD52 for writing Function Select in CCCR  */
#define   SDMMC_CR_CMDTYP_ABORT_Val           _UINT16_(0x3)                                        /* (SDMMC_CR) CMD12, CMD52 for writing I/O Abort in CCCR  */
#define SDMMC_CR_CMDTYP_NORMAL                (SDMMC_CR_CMDTYP_NORMAL_Val << SDMMC_CR_CMDTYP_Pos)  /* (SDMMC_CR) Other commands Position  */
#define SDMMC_CR_CMDTYP_SUSPEND               (SDMMC_CR_CMDTYP_SUSPEND_Val << SDMMC_CR_CMDTYP_Pos) /* (SDMMC_CR) CMD52 for writing Bus Suspend in CCCR Position  */
#define SDMMC_CR_CMDTYP_RESUME                (SDMMC_CR_CMDTYP_RESUME_Val << SDMMC_CR_CMDTYP_Pos)  /* (SDMMC_CR) CMD52 for writing Function Select in CCCR Position  */
#define SDMMC_CR_CMDTYP_ABORT                 (SDMMC_CR_CMDTYP_ABORT_Val << SDMMC_CR_CMDTYP_Pos)   /* (SDMMC_CR) CMD12, CMD52 for writing I/O Abort in CCCR Position  */
#define SDMMC_CR_CMDIDX_Pos                   _UINT16_(8)                                          /* (SDMMC_CR) Command Index Position */
#define SDMMC_CR_CMDIDX_Msk                   (_UINT16_(0x3F) << SDMMC_CR_CMDIDX_Pos)              /* (SDMMC_CR) Command Index Mask */
#define SDMMC_CR_CMDIDX(value)                (SDMMC_CR_CMDIDX_Msk & (_UINT16_(value) << SDMMC_CR_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDMMC_CR register */
#define SDMMC_CR_Msk                          _UINT16_(0x3FFB)                                     /* (SDMMC_CR) Register Mask  */


/* -------- SDMMC_RR : (SDMMC Offset: 0x10) ( R/ 32) Response -------- */
#define SDMMC_RR_RESETVALUE                   _UINT32_(0x00)                                       /*  (SDMMC_RR) Response  Reset Value */

#define SDMMC_RR_CMDRESP_Pos                  _UINT32_(0)                                          /* (SDMMC_RR) Command Response Position */
#define SDMMC_RR_CMDRESP_Msk                  (_UINT32_(0xFFFFFFFF) << SDMMC_RR_CMDRESP_Pos)       /* (SDMMC_RR) Command Response Mask */
#define SDMMC_RR_CMDRESP(value)               (SDMMC_RR_CMDRESP_Msk & (_UINT32_(value) << SDMMC_RR_CMDRESP_Pos)) /* Assigment of value for CMDRESP in the SDMMC_RR register */
#define SDMMC_RR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (SDMMC_RR) Register Mask  */


