jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/sdmmc.h
/* -------- SDMMC_PCR : (SDMMC Offset: 0x29) (R/W 8) Power Control -------- */
#define SDMMC_PCR_RESETVALUE                  _UINT8_(0x0E)                                        /*  (SDMMC_PCR) Power Control  Reset Value */

#define SDMMC_PCR_SDBPWR_Pos                  _UINT8_(0)                                           /* (SDMMC_PCR) SD Bus Power Position */
#define SDMMC_PCR_SDBPWR_Msk                  (_UINT8_(0x1) << SDMMC_PCR_SDBPWR_Pos)               /* (SDMMC_PCR) SD Bus Power Mask */
#define SDMMC_PCR_SDBPWR(value)               (SDMMC_PCR_SDBPWR_Msk & (_UINT8_(value) << SDMMC_PCR_SDBPWR_Pos)) /* Assigment of value for SDBPWR in the SDMMC_PCR register */
#define   SDMMC_PCR_SDBPWR_OFF_Val            _UINT8_(0x0)                                         /* (SDMMC_PCR) Power off  */
#define   SDMMC_PCR_SDBPWR_ON_Val             _UINT8_(0x1)                                         /* (SDMMC_PCR) Power on  */
#define SDMMC_PCR_SDBPWR_OFF                  (SDMMC_PCR_SDBPWR_OFF_Val << SDMMC_PCR_SDBPWR_Pos)   /* (SDMMC_PCR) Power off Position  */
#define SDMMC_PCR_SDBPWR_ON                   (SDMMC_PCR_SDBPWR_ON_Val << SDMMC_PCR_SDBPWR_Pos)    /* (SDMMC_PCR) Power on Position  */
#define SDMMC_PCR_SDBVSEL_Pos                 _UINT8_(1)                                           /* (SDMMC_PCR) SD Bus Voltage Select Position */
#define SDMMC_PCR_SDBVSEL_Msk                 (_UINT8_(0x7) << SDMMC_PCR_SDBVSEL_Pos)              /* (SDMMC_PCR) SD Bus Voltage Select Mask */
#define SDMMC_PCR_SDBVSEL(value)              (SDMMC_PCR_SDBVSEL_Msk & (_UINT8_(value) << SDMMC_PCR_SDBVSEL_Pos)) /* Assigment of value for SDBVSEL in the SDMMC_PCR register */
#define   SDMMC_PCR_SDBVSEL_1V8_Val           _UINT8_(0x5)                                         /* (SDMMC_PCR) 1.8V (Typ.)  */
#define   SDMMC_PCR_SDBVSEL_3V0_Val           _UINT8_(0x6)                                         /* (SDMMC_PCR) 3.0V (Typ.)  */
#define   SDMMC_PCR_SDBVSEL_3V3_Val           _UINT8_(0x7)                                         /* (SDMMC_PCR) 3.3V (Typ.)  */
#define SDMMC_PCR_SDBVSEL_1V8                 (SDMMC_PCR_SDBVSEL_1V8_Val << SDMMC_PCR_SDBVSEL_Pos) /* (SDMMC_PCR) 1.8V (Typ.) Position  */
#define SDMMC_PCR_SDBVSEL_3V0                 (SDMMC_PCR_SDBVSEL_3V0_Val << SDMMC_PCR_SDBVSEL_Pos) /* (SDMMC_PCR) 3.0V (Typ.) Position  */
#define SDMMC_PCR_SDBVSEL_3V3                 (SDMMC_PCR_SDBVSEL_3V3_Val << SDMMC_PCR_SDBVSEL_Pos) /* (SDMMC_PCR) 3.3V (Typ.) Position  */
#define SDMMC_PCR_Msk                         _UINT8_(0x0F)                                        /* (SDMMC_PCR) Register Mask  */


/* -------- SDMMC_BGCR : (SDMMC Offset: 0x2A) (R/W 8) Block Gap Control -------- */
#define SDMMC_BGCR_RESETVALUE                 _UINT8_(0x00)                                        /*  (SDMMC_BGCR) Block Gap Control  Reset Value */

#define SDMMC_BGCR_STPBGR_Pos                 _UINT8_(0)                                           /* (SDMMC_BGCR) Stop at Block Gap Request Position */
#define SDMMC_BGCR_STPBGR_Msk                 (_UINT8_(0x1) << SDMMC_BGCR_STPBGR_Pos)              /* (SDMMC_BGCR) Stop at Block Gap Request Mask */
#define SDMMC_BGCR_STPBGR(value)              (SDMMC_BGCR_STPBGR_Msk & (_UINT8_(value) << SDMMC_BGCR_STPBGR_Pos)) /* Assigment of value for STPBGR in the SDMMC_BGCR register */
#define   SDMMC_BGCR_STPBGR_TRANSFER_Val      _UINT8_(0x0)                                         /* (SDMMC_BGCR) Transfer  */
#define   SDMMC_BGCR_STPBGR_STOP_Val          _UINT8_(0x1)                                         /* (SDMMC_BGCR) Stop  */
#define SDMMC_BGCR_STPBGR_TRANSFER            (SDMMC_BGCR_STPBGR_TRANSFER_Val << SDMMC_BGCR_STPBGR_Pos) /* (SDMMC_BGCR) Transfer Position  */
#define SDMMC_BGCR_STPBGR_STOP                (SDMMC_BGCR_STPBGR_STOP_Val << SDMMC_BGCR_STPBGR_Pos) /* (SDMMC_BGCR) Stop Position  */
#define SDMMC_BGCR_CONTR_Pos                  _UINT8_(1)                                           /* (SDMMC_BGCR) Continue Request Position */
#define SDMMC_BGCR_CONTR_Msk                  (_UINT8_(0x1) << SDMMC_BGCR_CONTR_Pos)               /* (SDMMC_BGCR) Continue Request Mask */
#define SDMMC_BGCR_CONTR(value)               (SDMMC_BGCR_CONTR_Msk & (_UINT8_(value) << SDMMC_BGCR_CONTR_Pos)) /* Assigment of value for CONTR in the SDMMC_BGCR register */
#define   SDMMC_BGCR_CONTR_GO_ON_Val          _UINT8_(0x0)                                         /* (SDMMC_BGCR) Not affected  */
#define   SDMMC_BGCR_CONTR_RESTART_Val        _UINT8_(0x1)                                         /* (SDMMC_BGCR) Restart  */
#define SDMMC_BGCR_CONTR_GO_ON                (SDMMC_BGCR_CONTR_GO_ON_Val << SDMMC_BGCR_CONTR_Pos) /* (SDMMC_BGCR) Not affected Position  */
#define SDMMC_BGCR_CONTR_RESTART              (SDMMC_BGCR_CONTR_RESTART_Val << SDMMC_BGCR_CONTR_Pos) /* (SDMMC_BGCR) Restart Position  */
#define SDMMC_BGCR_RWCTRL_Pos                 _UINT8_(2)                                           /* (SDMMC_BGCR) Read Wait Control Position */
#define SDMMC_BGCR_RWCTRL_Msk                 (_UINT8_(0x1) << SDMMC_BGCR_RWCTRL_Pos)              /* (SDMMC_BGCR) Read Wait Control Mask */
#define SDMMC_BGCR_RWCTRL(value)              (SDMMC_BGCR_RWCTRL_Msk & (_UINT8_(value) << SDMMC_BGCR_RWCTRL_Pos)) /* Assigment of value for RWCTRL in the SDMMC_BGCR register */
#define   SDMMC_BGCR_RWCTRL_DISABLE_Val       _UINT8_(0x0)                                         /* (SDMMC_BGCR) Disable Read Wait Control  */
#define   SDMMC_BGCR_RWCTRL_ENABLE_Val        _UINT8_(0x1)                                         /* (SDMMC_BGCR) Enable Read Wait Control  */
#define SDMMC_BGCR_RWCTRL_DISABLE             (SDMMC_BGCR_RWCTRL_DISABLE_Val << SDMMC_BGCR_RWCTRL_Pos) /* (SDMMC_BGCR) Disable Read Wait Control Position  */
#define SDMMC_BGCR_RWCTRL_ENABLE              (SDMMC_BGCR_RWCTRL_ENABLE_Val << SDMMC_BGCR_RWCTRL_Pos) /* (SDMMC_BGCR) Enable Read Wait Control Position  */
#define SDMMC_BGCR_INTBG_Pos                  _UINT8_(3)                                           /* (SDMMC_BGCR) Interrupt at Block Gap Position */
#define SDMMC_BGCR_INTBG_Msk                  (_UINT8_(0x1) << SDMMC_BGCR_INTBG_Pos)               /* (SDMMC_BGCR) Interrupt at Block Gap Mask */
#define SDMMC_BGCR_INTBG(value)               (SDMMC_BGCR_INTBG_Msk & (_UINT8_(value) << SDMMC_BGCR_INTBG_Pos)) /* Assigment of value for INTBG in the SDMMC_BGCR register */
#define   SDMMC_BGCR_INTBG_DISABLED_Val       _UINT8_(0x0)                                         /* (SDMMC_BGCR) Disabled  */
#define   SDMMC_BGCR_INTBG_ENABLED_Val        _UINT8_(0x1)                                         /* (SDMMC_BGCR) Enabled  */
#define SDMMC_BGCR_INTBG_DISABLED             (SDMMC_BGCR_INTBG_DISABLED_Val << SDMMC_BGCR_INTBG_Pos) /* (SDMMC_BGCR) Disabled Position  */
#define SDMMC_BGCR_INTBG_ENABLED              (SDMMC_BGCR_INTBG_ENABLED_Val << SDMMC_BGCR_INTBG_Pos) /* (SDMMC_BGCR) Enabled Position  */
#define SDMMC_BGCR_Msk                        _UINT8_(0x0F)                                        /* (SDMMC_BGCR) Register Mask  */

/* EMMC mode */
#define SDMMC_BGCR_EMMC_Msk                   _UINT8_(0x00)                                         /* (SDMMC_BGCR_EMMC) Register Mask  */


/* -------- SDMMC_WCR : (SDMMC Offset: 0x2B) (R/W 8) Wakeup Control -------- */
#define SDMMC_WCR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDMMC_WCR) Wakeup Control  Reset Value */

#define SDMMC_WCR_WKENCINT_Pos                _UINT8_(0)                                           /* (SDMMC_WCR) Wakeup Event Enable on Card Interrupt Position */
#define SDMMC_WCR_WKENCINT_Msk                (_UINT8_(0x1) << SDMMC_WCR_WKENCINT_Pos)             /* (SDMMC_WCR) Wakeup Event Enable on Card Interrupt Mask */
#define SDMMC_WCR_WKENCINT(value)             (SDMMC_WCR_WKENCINT_Msk & (_UINT8_(value) << SDMMC_WCR_WKENCINT_Pos)) /* Assigment of value for WKENCINT in the SDMMC_WCR register */
#define   SDMMC_WCR_WKENCINT_DISABLE_Val      _UINT8_(0x0)                                         /* (SDMMC_WCR) Disable  */
#define   SDMMC_WCR_WKENCINT_ENABLE_Val       _UINT8_(0x1)                                         /* (SDMMC_WCR) Enable  */
#define SDMMC_WCR_WKENCINT_DISABLE            (SDMMC_WCR_WKENCINT_DISABLE_Val << SDMMC_WCR_WKENCINT_Pos) /* (SDMMC_WCR) Disable Position  */
#define SDMMC_WCR_WKENCINT_ENABLE             (SDMMC_WCR_WKENCINT_ENABLE_Val << SDMMC_WCR_WKENCINT_Pos) /* (SDMMC_WCR) Enable Position  */
#define SDMMC_WCR_WKENCINS_Pos                _UINT8_(1)                                           /* (SDMMC_WCR) Wakeup Event Enable on Card Insertion Position */
#define SDMMC_WCR_WKENCINS_Msk                (_UINT8_(0x1) << SDMMC_WCR_WKENCINS_Pos)             /* (SDMMC_WCR) Wakeup Event Enable on Card Insertion Mask */
#define SDMMC_WCR_WKENCINS(value)             (SDMMC_WCR_WKENCINS_Msk & (_UINT8_(value) << SDMMC_WCR_WKENCINS_Pos)) /* Assigment of value for WKENCINS in the SDMMC_WCR register */
#define   SDMMC_WCR_WKENCINS_DISABLE_Val      _UINT8_(0x0)                                         /* (SDMMC_WCR) Disable  */
#define   SDMMC_WCR_WKENCINS_ENABLE_Val       _UINT8_(0x1)                                         /* (SDMMC_WCR) Enable  */
#define SDMMC_WCR_WKENCINS_DISABLE            (SDMMC_WCR_WKENCINS_DISABLE_Val << SDMMC_WCR_WKENCINS_Pos) /* (SDMMC_WCR) Disable Position  */
#define SDMMC_WCR_WKENCINS_ENABLE             (SDMMC_WCR_WKENCINS_ENABLE_Val << SDMMC_WCR_WKENCINS_Pos) /* (SDMMC_WCR) Enable Position  */
#define SDMMC_WCR_WKENCREM_Pos                _UINT8_(2)                                           /* (SDMMC_WCR) Wakeup Event Enable on Card Removal Position */
#define SDMMC_WCR_WKENCREM_Msk                (_UINT8_(0x1) << SDMMC_WCR_WKENCREM_Pos)             /* (SDMMC_WCR) Wakeup Event Enable on Card Removal Mask */
#define SDMMC_WCR_WKENCREM(value)             (SDMMC_WCR_WKENCREM_Msk & (_UINT8_(value) << SDMMC_WCR_WKENCREM_Pos)) /* Assigment of value for WKENCREM in the SDMMC_WCR register */
#define   SDMMC_WCR_WKENCREM_DISABLE_Val      _UINT8_(0x0)                                         /* (SDMMC_WCR) Disable  */
#define   SDMMC_WCR_WKENCREM_ENABLE_Val       _UINT8_(0x1)                                         /* (SDMMC_WCR) Enable  */
#define SDMMC_WCR_WKENCREM_DISABLE            (SDMMC_WCR_WKENCREM_DISABLE_Val << SDMMC_WCR_WKENCREM_Pos) /* (SDMMC_WCR) Disable Position  */
#define SDMMC_WCR_WKENCREM_ENABLE             (SDMMC_WCR_WKENCREM_ENABLE_Val << SDMMC_WCR_WKENCREM_Pos) /* (SDMMC_WCR) Enable Position  */
#define SDMMC_WCR_Msk                         _UINT8_(0x07)                                        /* (SDMMC_WCR) Register Mask  */


