jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/sdmmc.h
/* -------- SDMMC_CCR : (SDMMC Offset: 0x2C) (R/W 16) Clock Control -------- */
#define SDMMC_CCR_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDMMC_CCR) Clock Control  Reset Value */

#define SDMMC_CCR_INTCLKEN_Pos                _UINT16_(0)                                          /* (SDMMC_CCR) Internal Clock Enable Position */
#define SDMMC_CCR_INTCLKEN_Msk                (_UINT16_(0x1) << SDMMC_CCR_INTCLKEN_Pos)            /* (SDMMC_CCR) Internal Clock Enable Mask */
#define SDMMC_CCR_INTCLKEN(value)             (SDMMC_CCR_INTCLKEN_Msk & (_UINT16_(value) << SDMMC_CCR_INTCLKEN_Pos)) /* Assigment of value for INTCLKEN in the SDMMC_CCR register */
#define   SDMMC_CCR_INTCLKEN_OFF_Val          _UINT16_(0x0)                                        /* (SDMMC_CCR) Stop  */
#define   SDMMC_CCR_INTCLKEN_ON_Val           _UINT16_(0x1)                                        /* (SDMMC_CCR) Oscillate  */
#define SDMMC_CCR_INTCLKEN_OFF                (SDMMC_CCR_INTCLKEN_OFF_Val << SDMMC_CCR_INTCLKEN_Pos) /* (SDMMC_CCR) Stop Position  */
#define SDMMC_CCR_INTCLKEN_ON                 (SDMMC_CCR_INTCLKEN_ON_Val << SDMMC_CCR_INTCLKEN_Pos) /* (SDMMC_CCR) Oscillate Position  */
#define SDMMC_CCR_INTCLKS_Pos                 _UINT16_(1)                                          /* (SDMMC_CCR) Internal Clock Stable Position */
#define SDMMC_CCR_INTCLKS_Msk                 (_UINT16_(0x1) << SDMMC_CCR_INTCLKS_Pos)             /* (SDMMC_CCR) Internal Clock Stable Mask */
#define SDMMC_CCR_INTCLKS(value)              (SDMMC_CCR_INTCLKS_Msk & (_UINT16_(value) << SDMMC_CCR_INTCLKS_Pos)) /* Assigment of value for INTCLKS in the SDMMC_CCR register */
#define   SDMMC_CCR_INTCLKS_NOT_READY_Val     _UINT16_(0x0)                                        /* (SDMMC_CCR) Not Ready  */
#define   SDMMC_CCR_INTCLKS_READY_Val         _UINT16_(0x1)                                        /* (SDMMC_CCR) Ready  */
#define SDMMC_CCR_INTCLKS_NOT_READY           (SDMMC_CCR_INTCLKS_NOT_READY_Val << SDMMC_CCR_INTCLKS_Pos) /* (SDMMC_CCR) Not Ready Position  */
#define SDMMC_CCR_INTCLKS_READY               (SDMMC_CCR_INTCLKS_READY_Val << SDMMC_CCR_INTCLKS_Pos) /* (SDMMC_CCR) Ready Position  */
#define SDMMC_CCR_SDCLKEN_Pos                 _UINT16_(2)                                          /* (SDMMC_CCR) SD Clock Enable Position */
#define SDMMC_CCR_SDCLKEN_Msk                 (_UINT16_(0x1) << SDMMC_CCR_SDCLKEN_Pos)             /* (SDMMC_CCR) SD Clock Enable Mask */
#define SDMMC_CCR_SDCLKEN(value)              (SDMMC_CCR_SDCLKEN_Msk & (_UINT16_(value) << SDMMC_CCR_SDCLKEN_Pos)) /* Assigment of value for SDCLKEN in the SDMMC_CCR register */
#define   SDMMC_CCR_SDCLKEN_DISABLE_Val       _UINT16_(0x0)                                        /* (SDMMC_CCR) Disable  */
#define   SDMMC_CCR_SDCLKEN_ENABLE_Val        _UINT16_(0x1)                                        /* (SDMMC_CCR) Enable  */
#define SDMMC_CCR_SDCLKEN_DISABLE             (SDMMC_CCR_SDCLKEN_DISABLE_Val << SDMMC_CCR_SDCLKEN_Pos) /* (SDMMC_CCR) Disable Position  */
#define SDMMC_CCR_SDCLKEN_ENABLE              (SDMMC_CCR_SDCLKEN_ENABLE_Val << SDMMC_CCR_SDCLKEN_Pos) /* (SDMMC_CCR) Enable Position  */
#define SDMMC_CCR_CLKGSEL_Pos                 _UINT16_(5)                                          /* (SDMMC_CCR) Clock Generator Select Position */
#define SDMMC_CCR_CLKGSEL_Msk                 (_UINT16_(0x1) << SDMMC_CCR_CLKGSEL_Pos)             /* (SDMMC_CCR) Clock Generator Select Mask */
#define SDMMC_CCR_CLKGSEL(value)              (SDMMC_CCR_CLKGSEL_Msk & (_UINT16_(value) << SDMMC_CCR_CLKGSEL_Pos)) /* Assigment of value for CLKGSEL in the SDMMC_CCR register */
#define   SDMMC_CCR_CLKGSEL_DIV_Val           _UINT16_(0x0)                                        /* (SDMMC_CCR) Divided Clock Mode  */
#define   SDMMC_CCR_CLKGSEL_PROG_Val          _UINT16_(0x1)                                        /* (SDMMC_CCR) Programmable Clock Mode  */
#define SDMMC_CCR_CLKGSEL_DIV                 (SDMMC_CCR_CLKGSEL_DIV_Val << SDMMC_CCR_CLKGSEL_Pos) /* (SDMMC_CCR) Divided Clock Mode Position  */
#define SDMMC_CCR_CLKGSEL_PROG                (SDMMC_CCR_CLKGSEL_PROG_Val << SDMMC_CCR_CLKGSEL_Pos) /* (SDMMC_CCR) Programmable Clock Mode Position  */
#define SDMMC_CCR_USDCLKFSEL_Pos              _UINT16_(6)                                          /* (SDMMC_CCR) Upper Bits of SDCLK Frequency Select Position */
#define SDMMC_CCR_USDCLKFSEL_Msk              (_UINT16_(0x3) << SDMMC_CCR_USDCLKFSEL_Pos)          /* (SDMMC_CCR) Upper Bits of SDCLK Frequency Select Mask */
#define SDMMC_CCR_USDCLKFSEL(value)           (SDMMC_CCR_USDCLKFSEL_Msk & (_UINT16_(value) << SDMMC_CCR_USDCLKFSEL_Pos)) /* Assigment of value for USDCLKFSEL in the SDMMC_CCR register */
#define SDMMC_CCR_SDCLKFSEL_Pos               _UINT16_(8)                                          /* (SDMMC_CCR) SDCLK Frequency Select Position */
#define SDMMC_CCR_SDCLKFSEL_Msk               (_UINT16_(0xFF) << SDMMC_CCR_SDCLKFSEL_Pos)          /* (SDMMC_CCR) SDCLK Frequency Select Mask */
#define SDMMC_CCR_SDCLKFSEL(value)            (SDMMC_CCR_SDCLKFSEL_Msk & (_UINT16_(value) << SDMMC_CCR_SDCLKFSEL_Pos)) /* Assigment of value for SDCLKFSEL in the SDMMC_CCR register */
#define SDMMC_CCR_Msk                         _UINT16_(0xFFE7)                                     /* (SDMMC_CCR) Register Mask  */


/* -------- SDMMC_TCR : (SDMMC Offset: 0x2E) (R/W 8) Timeout Control -------- */
#define SDMMC_TCR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDMMC_TCR) Timeout Control  Reset Value */

#define SDMMC_TCR_DTCVAL_Pos                  _UINT8_(0)                                           /* (SDMMC_TCR) Data Timeout Counter Value Position */
#define SDMMC_TCR_DTCVAL_Msk                  (_UINT8_(0xF) << SDMMC_TCR_DTCVAL_Pos)               /* (SDMMC_TCR) Data Timeout Counter Value Mask */
#define SDMMC_TCR_DTCVAL(value)               (SDMMC_TCR_DTCVAL_Msk & (_UINT8_(value) << SDMMC_TCR_DTCVAL_Pos)) /* Assigment of value for DTCVAL in the SDMMC_TCR register */
#define SDMMC_TCR_Msk                         _UINT8_(0x0F)                                        /* (SDMMC_TCR) Register Mask  */


/* -------- SDMMC_SRR : (SDMMC Offset: 0x2F) (R/W 8) Software Reset -------- */
#define SDMMC_SRR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDMMC_SRR) Software Reset  Reset Value */

