jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/sdmmc.h
/* -------- SDMMC_DEBR : (SDMMC Offset: 0x207) (R/W 8) Debounce Register -------- */
#define SDMMC_DEBR_RESETVALUE                 _UINT8_(0x03)                                        /*  (SDMMC_DEBR) Debounce Register  Reset Value */

#define SDMMC_DEBR_CDDVAL_Pos                 _UINT8_(0)                                           /* (SDMMC_DEBR) Card Detect Debounce Value Position */
#define SDMMC_DEBR_CDDVAL_Msk                 (_UINT8_(0x3) << SDMMC_DEBR_CDDVAL_Pos)              /* (SDMMC_DEBR) Card Detect Debounce Value Mask */
#define SDMMC_DEBR_CDDVAL(value)              (SDMMC_DEBR_CDDVAL_Msk & (_UINT8_(value) << SDMMC_DEBR_CDDVAL_Pos)) /* Assigment of value for CDDVAL in the SDMMC_DEBR register */
#define   SDMMC_DEBR_CDDVAL_1CYCLE_Val        _UINT8_(0x0)                                         /* (SDMMC_DEBR) 1 slow clock cycle  */
#define   SDMMC_DEBR_CDDVAL_8CYCLES_Val       _UINT8_(0x1)                                         /* (SDMMC_DEBR) 8 slow clock cycles  */
#define   SDMMC_DEBR_CDDVAL_33CYCLES_Val      _UINT8_(0x2)                                         /* (SDMMC_DEBR) 33 slow clock cycle  */
#define   SDMMC_DEBR_CDDVAL_328CYCLES_Val     _UINT8_(0x3)                                         /* (SDMMC_DEBR) 328 slow clock cycle  */
#define SDMMC_DEBR_CDDVAL_1CYCLE              (SDMMC_DEBR_CDDVAL_1CYCLE_Val << SDMMC_DEBR_CDDVAL_Pos) /* (SDMMC_DEBR) 1 slow clock cycle Position  */
#define SDMMC_DEBR_CDDVAL_8CYCLES             (SDMMC_DEBR_CDDVAL_8CYCLES_Val << SDMMC_DEBR_CDDVAL_Pos) /* (SDMMC_DEBR) 8 slow clock cycles Position  */
#define SDMMC_DEBR_CDDVAL_33CYCLES            (SDMMC_DEBR_CDDVAL_33CYCLES_Val << SDMMC_DEBR_CDDVAL_Pos) /* (SDMMC_DEBR) 33 slow clock cycle Position  */
#define SDMMC_DEBR_CDDVAL_328CYCLES           (SDMMC_DEBR_CDDVAL_328CYCLES_Val << SDMMC_DEBR_CDDVAL_Pos) /* (SDMMC_DEBR) 328 slow clock cycle Position  */
#define SDMMC_DEBR_Msk                        _UINT8_(0x03)                                        /* (SDMMC_DEBR) Register Mask  */


/* -------- SDMMC_ACR : (SDMMC Offset: 0x208) (R/W 32) AHB Control -------- */
#define SDMMC_ACR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDMMC_ACR) AHB Control  Reset Value */

#define SDMMC_ACR_BMAX_Pos                    _UINT32_(0)                                          /* (SDMMC_ACR) AHB Maximum Burst Position */
#define SDMMC_ACR_BMAX_Msk                    (_UINT32_(0x3) << SDMMC_ACR_BMAX_Pos)                /* (SDMMC_ACR) AHB Maximum Burst Mask */
#define SDMMC_ACR_BMAX(value)                 (SDMMC_ACR_BMAX_Msk & (_UINT32_(value) << SDMMC_ACR_BMAX_Pos)) /* Assigment of value for BMAX in the SDMMC_ACR register */
#define   SDMMC_ACR_BMAX_INCR16_Val           _UINT32_(0x0)                                        /* (SDMMC_ACR)   */
#define   SDMMC_ACR_BMAX_INCR8_Val            _UINT32_(0x1)                                        /* (SDMMC_ACR)   */
#define   SDMMC_ACR_BMAX_INCR4_Val            _UINT32_(0x2)                                        /* (SDMMC_ACR)   */
#define   SDMMC_ACR_BMAX_SINGLE_Val           _UINT32_(0x3)                                        /* (SDMMC_ACR)   */
#define SDMMC_ACR_BMAX_INCR16                 (SDMMC_ACR_BMAX_INCR16_Val << SDMMC_ACR_BMAX_Pos)    /* (SDMMC_ACR)  Position  */
#define SDMMC_ACR_BMAX_INCR8                  (SDMMC_ACR_BMAX_INCR8_Val << SDMMC_ACR_BMAX_Pos)     /* (SDMMC_ACR)  Position  */
#define SDMMC_ACR_BMAX_INCR4                  (SDMMC_ACR_BMAX_INCR4_Val << SDMMC_ACR_BMAX_Pos)     /* (SDMMC_ACR)  Position  */
#define SDMMC_ACR_BMAX_SINGLE                 (SDMMC_ACR_BMAX_SINGLE_Val << SDMMC_ACR_BMAX_Pos)    /* (SDMMC_ACR)  Position  */
#define SDMMC_ACR_Msk                         _UINT32_(0x00000003)                                 /* (SDMMC_ACR) Register Mask  */


/* -------- SDMMC_CC2R : (SDMMC Offset: 0x20C) (R/W 32) Clock Control 2 -------- */
#define SDMMC_CC2R_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDMMC_CC2R) Clock Control 2  Reset Value */

#define SDMMC_CC2R_FSDCLKD_Pos                _UINT32_(0)                                          /* (SDMMC_CC2R) Force SDCK Disabled Position */
#define SDMMC_CC2R_FSDCLKD_Msk                (_UINT32_(0x1) << SDMMC_CC2R_FSDCLKD_Pos)            /* (SDMMC_CC2R) Force SDCK Disabled Mask */
#define SDMMC_CC2R_FSDCLKD(value)             (SDMMC_CC2R_FSDCLKD_Msk & (_UINT32_(value) << SDMMC_CC2R_FSDCLKD_Pos)) /* Assigment of value for FSDCLKD in the SDMMC_CC2R register */
#define   SDMMC_CC2R_FSDCLKD_NOEFFECT_Val     _UINT32_(0x0)                                        /* (SDMMC_CC2R) No effect  */
#define   SDMMC_CC2R_FSDCLKD_DISABLE_Val      _UINT32_(0x1)                                        /* (SDMMC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled  */
#define SDMMC_CC2R_FSDCLKD_NOEFFECT           (SDMMC_CC2R_FSDCLKD_NOEFFECT_Val << SDMMC_CC2R_FSDCLKD_Pos) /* (SDMMC_CC2R) No effect Position  */
#define SDMMC_CC2R_FSDCLKD_DISABLE            (SDMMC_CC2R_FSDCLKD_DISABLE_Val << SDMMC_CC2R_FSDCLKD_Pos) /* (SDMMC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled Position  */
#define SDMMC_CC2R_Msk                        _UINT32_(0x00000001)                                 /* (SDMMC_CC2R) Register Mask  */


/* -------- SDMMC_CACR : (SDMMC Offset: 0x230) (R/W 32) Capabilities Control -------- */
#define SDMMC_CACR_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDMMC_CACR) Capabilities Control  Reset Value */

#define SDMMC_CACR_CAPWREN_Pos                _UINT32_(0)                                          /* (SDMMC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Position */
#define SDMMC_CACR_CAPWREN_Msk                (_UINT32_(0x1) << SDMMC_CACR_CAPWREN_Pos)            /* (SDMMC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Mask */
#define SDMMC_CACR_CAPWREN(value)             (SDMMC_CACR_CAPWREN_Msk & (_UINT32_(value) << SDMMC_CACR_CAPWREN_Pos)) /* Assigment of value for CAPWREN in the SDMMC_CACR register */
#define SDMMC_CACR_KEY_Pos                    _UINT32_(8)                                          /* (SDMMC_CACR) Key (0x46) Position */
#define SDMMC_CACR_KEY_Msk                    (_UINT32_(0xFF) << SDMMC_CACR_KEY_Pos)               /* (SDMMC_CACR) Key (0x46) Mask */
#define SDMMC_CACR_KEY(value)                 (SDMMC_CACR_KEY_Msk & (_UINT32_(value) << SDMMC_CACR_KEY_Pos)) /* Assigment of value for KEY in the SDMMC_CACR register */
#define SDMMC_CACR_Msk                        _UINT32_(0x0000FF01)                                 /* (SDMMC_CACR) Register Mask  */


/* -------- SDMMC_DBGR : (SDMMC Offset: 0x234) (R/W 32) Debug -------- */
#define SDMMC_DBGR_RESETVALUE                 _UINT32_(0x02)                                       /*  (SDMMC_DBGR) Debug  Reset Value */

